Revit 2024 API
WorksharingTooltipInfo Class
 Worksharing information about a single element suitable for display in an in-canvas tooltip.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class WorksharingTooltipInfo : IDisposable
Visual Basic
Public Class WorksharingTooltipInfo _
	Implements IDisposable
Visual C++
public ref class WorksharingTooltipInfo : IDisposable
Remarks
 Some or all of the strings may be empty.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksharingTooltipInfo
See Also
WorksharingTooltipInfo Members
Autodesk.Revit.DB Namespace